---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.PipePressureDropData
source: html/140b79e1-baa8-d5c8-81a2-c06f60f62232.htm
---
# PipePressureDropData Properties

The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.